Verified that this is a change in behavior between **v5.58.0** and **v5.62.0**:

#### v5.58.0

```
% terraform apply
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "service-first"
                  + memory       = 512
                  + name         = "first"
                  + portMappings = []
                },
            ]
        )
      + family                = "ewbankkit-test-001"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = (known after apply)
      + track_latest          = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecs_task_definition.service: Creating...
aws_ecs_task_definition.service: Creation complete after 0s [id=ewbankkit-test-001]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

#### v5.62.0

```
% terraform apply
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "service-first"
                  + memory       = 512
                  + name         = "first"
                  + portMappings = [
                      + {},
                    ]
                },
            ]
        )
      + family                = "ewbankkit-test-001"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = (known after apply)
      + track_latest          = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecs_task_definition.service: Creating...
╷
│ Error: creating ECS Task Definition (ewbankkit-test-001): operation error ECS: RegisterTaskDefinition, https response error StatusCode: 400, RequestID: 75147d53-07c7-4cb3-bcc6-ad0da7038c07, ClientException: Invalid 'containerPort' setting for container 'first'.
│ 
│   with aws_ecs_task_definition.service,
│   on main.tf line 3, in resource "aws_ecs_task_definition" "service":
│    3: resource "aws_ecs_task_definition" "service" {
│ 
╵
```